package com.mohammad.kk.findmove

object HelperMoves {
    const val name = "نام فيلم:"
    const val nameDirector = "نام كارگردان:"
    const val yearOfConstruction = "سال ساخت:"
    const val nameAuthor = "نام نويسنده:"
    const val godfatherName = "پدر خوانده - Godfather"
    const val godfatherNameDirector = "فرانسیس فورد کوپولا"
    const val godfatherYearOfConstruction = "1972"
    const val godfatherNameAuthor = "ماریو پوزو"
    const val godfatherFullDescription =
        "پدرخوانده در سال 1972 ساخته شد و داستانی از خانواده مافیایی کورلئونه را به تصویر کشید. پیش از گاد فادر، هیچ فیلم و هیچ کارگردانی با چنین وسعتی داستان\u200Cهای مافیایی و گانگستری نساخته بودند و پدر خوانده به نوبه\u200Cی خود آغازگر این سبک از فیلم\u200Cها بود. سبکی که امروزه طرفداران زیادی پیدا کرده و هرساله مشاهده می\u200Cکنیم که چند فیلم با روایت\u200Cهایی از خلافکاران و گانگسترهای قدیمی توسط تیم\u200Cهای تولید بزرگ ساخته می\u200Cشوند.\n" +
                "تیم بازیگری 3 گانه\u200Cی پدر خوانده نیز همانند کارگردانی آن، از مشهورترین بازیگران سینما تشکیل شده بود. اسامی همچون «مارلون براندو»، آل پاچینو، رابرت دووال، دایان کیتمن و جیمز کان در این فیلم ایفای نقش کردند.\n" +
                "در پی موفقیت کم سابقه\u200Cی قسمت اول این مجموعه، 2 سال بعد قسمت دو این فیلم و نهایتا در سال 1990، قسمت سوم این فیلم ساخته شدند. با وجود موفقیت قسمت\u200Cهای دوم و سوم این فیلم، فورد کوپولا (کارگردان مجموعه) بیان کرده بود که: فقط باید فیلم اول را می\u200Cساختم.\n"
    const val cityOfGodsName = "شهر خدایان - City of gods"
    const val cityOfGodsNameDirector = "فرناندو میرلز، کاتیا لوند"
    const val cityOfGodsYearOfConstruction = "2002"
    const val cityOfGodsNameAuthor = "فپائولو لینز"
    const val cityOfGodsFullDescription = "یکی دیگر از بهترین فیلم های درام، فیلم زیبا و تماشایی شهر خدایان است. این فیلم در سال 2002 توسط فرناندو میرلس ساخته شد و جزء فیلم\u200Cهایی در سبک درام گانگستری قرار می\u200Cگیرد.\n" +
            "داستان فیلم در مورد دوره\u200Cای بین سال\u200Cهای 60 تا 80 در کشور برزیل و شهر ریو دوژانیرو است. دوره\u200Cای که جرم و جنایت سر به فلک کشیده بود و حتی کودکان نیز رنگ و بوی گانگسترها را به خود گرفته بودند.\n" +
            "خط روایتی فیلم سعی در تفهیم شعار زیر را دارد.\n" +
            "هیولا گریزان را می\u200Cگیرد و آنکه می\u200Cماند را می\u200Cبلعد.\n" +
            "این فیلم در اُسکار همان سال، در 4 بخش نامزد کسب جایزه شد که از دریافت نهایی آن\u200Cها باز ماند.\n"
    const val millionDollarBabyName = "عزیز میلیون دلاری - Million Dollar Baby"
    const val millionDollarBabyNameDirector = "لینت ایستوود"
    const val millionDollarBabyYearOfConstruction = "2004"
    const val millionDollarBabyNameAuthor = "اف. ايكس. توله(داستان)، پل هگيس(فيلم نامه)"
    const val millionDollarBabyFullDescription = "این فیلم در سال 2004 تولید شد و در دسته بندی «درام ورزشی» قرار می\u200Cگیرد. کارگردانی آن توسط کلینت ایستوود به انجام رسید و بازیگران اصلی آن «کلینت ایستوود، هیلاری سوانک و مورگان فریمن» بودند.\n" +
            "\n" +
            "لازم به ذکر است که \"عزیز میلیون دلاری\" یکی از 250 فیلم برتر iMDB است و انتقادات مثبت و منفی زیادی به خود گرفته.\n" +
            "\n" +
            "داستان این فیلم در مورد دختری به نام مگی فیتز جرالد است. دختری از قشر فقیر جامعه که متوجه می\u200Cشود به بوکس علاقه مند است. مگی تصمیم میگیرد فرانکی دان را به عنوان مربی خود انتخاب کند. فرانکی یکی از بزرگترین مربی\u200Cهای بوکس است و درخواست مگی را قبول نمیکند و حتی برخورد خشنی با مگی می\u200Cکند تا او را از تصمیم خود منصرف کند. نهایتا پس از تمرینات سخت و مداومی که مگی انجام می\u200Cدهد، فرانکی تصمیم میگیرد که روی برخی حرکت\u200Cها به او کمک کند. این تمرینات کم کم بیشتر می\u200Cشوند و به جایی میرسد که فرانکی، مگی را به تورنومنت\u200Cهای آماتوری بوکس می\u200Cبرد.\n" +
            "\n" +
            "مگی دختری مصمم و سخت کوش است و تمام رقبای خود را در راند اول و گاها با ضربات اول ناک اوت می\u200Cکند و دیگر رقیبی حاضر به مسابقه با او نمی\u200Cشود، بنابراین فرانکی اورا به لیگ حرفه\u200Cای می\u200Cبرد. جایی که در مسابقه\u200Cی نهایی با رقیب خود اتفاقی غیر منتظره رخ می\u200Cدهد و مسیر فیلم را عوض می\u200Cکند.\n" +
            "\n" +
            "ادامه\u200Cی داستان فیلم شوک بزرگی به بیننده وارد می\u200Cکند و پیشنهاد می\u200Cکنم مابقی داستان را خودتان مشاهده نمایید تا جذابیت فیلم از بین نرود."
    const val theIrishmanName = "مرد ایرلندی - The Irishman"
    const val theIrishmanNameDirector = "مارتین اسکورسیزی"
    const val theIrishmanYearOfConstruction = "2019"
    const val theIrishmanNameAuthor = "استیون زایلیان"
    const val theIrishmanFullDescription = "مرد ایرلندی، یکی از شاهکارها و بهترین فیلم\u200Cهای 2019 که توسط مارتین اسکورسیزی ساخته شد و ستارگان بزرگ هالیوود در آن ایفای نقش کردند. از جمله بازیگران این فیلم می\u200Cتوان به رابرت دنیرو، آل پاچینو، جو پشی، بابی کاناوله، هاروی کایتل و ری رومانو اشاره کرد.\n" +
            "داستان فیلم در مورد دوره\u200Cهای مختلف زندگی فرانک شیرن، یکی از اعضای سندیکای کارگردان ایالات متحده را نشان می\u200Cدهد که پس از آشنایی با خانواده خلافکار و مافیایی راسل بوفالینو، به موفقیت\u200Cهای زیادی دست پیدا میکند.\n" +
            "به طور کلی ماجرای فیلم در دهه 1950 میلادی آغاز می\u200Cشود. زمانی که فرانک شیرن (رابرت دنیرو) با راسل بوفالینو (جو پشی) ارتباط برقرار می\u200Cکند و تبدیل به یک قاتل قراردادی می\u200Cشود. در همین حین فرانک به عنوان محافظ و همراه جیمی هوفا (آل پاچینو) که یکی از مقامات و رهبران اتحادیه کارگران آمریکا است انتخاب می\u200Cشود و در 2 مسیر متفاوت زندگی\u200Cاش را جلو می\u200Cبرد.\n" +
            "مرد ایرلندی یکی از مورد ستایش\u200Cترین آثار سال 2019 بود و انجمن منتقدین این فیلم را «بهترین فیلم 2019» نامیدند.\n" +
            "مرد ایرلندی در بخش\u200Cهای زیادی از جشنواره\u200Cهای اُسکار و گلدن گلوب نامزد کسب جایزه شد اما نهایتا از دریافت آن\u200Cها بازماند. حضور رقبای سرسخت یکی از دلایل ناکامی این فیلم در فستیوال\u200Cها و جشنواره\u200Cهای سینمایی بود.\n" +
            "آیریش من (The Irishman) یکی از طولانی\u200Cترین آثار اسکورسیزی بود و در قالب 209 دقیقه مخاطب را درگیر خود می\u200Cکند. اگر به دنبال تماشای فیلم درام باشید، مرد ایرلندی یکی از بهترین گزینه\u200Cهای ممکن برای شماست.\n"
    const val heatName = "مخمصه - Heat"
    const val heatNameDirector = "مایکل مان"
    const val heatYearOfConstruction = "1995"
    const val heatNameAuthor = "مایکل مان"
    const val heatFullDescription = "یکی دیگر از بهترین فیلم های درام، فیلم مخمصه (Heat) است که در ژانر درام-جنایی ساخته شده. کارگردانی این فیلم توسط مایکل مان به انجام رسیده و بازیگران بزرگی همچون آل پاچینو، رابرت دنیرو، وال کیلمر، تام سایزمور و ناتالی پورتمن در آن به ایفای نقش پرداخته\u200Cاند.\n" +
            "حضور دو غول بزرگ سینمای قرن 20 در یک فیلم، نکته\u200Cای بود که منتقدین آن را مورد ستایش قرار دادند. تا پیش از سال 1995 که فیلم مخصمه ساخته شود، پاچینو و دنیرو یک بار در قسمت دوم از مجموعه پدرخوانده باهم هم بازی شده بودند اما زمان حضور آن\u200Cها مقابل هم خیلی کم بود. در مخمصه اما این اتفاق افتاد، پاچینو در نقش یک کارآگاه پلیس و دنیرو در نقش یک سارق حرفه\u200Cای مقابل هم قرار گرفتند و یکی از بهترین و مشهورترین سکانس\u200Cهای تاریخ سینما را پدید آوردند. به گفته\u200Cی منتقدین، درون گرایی رابرت دنیرو و برون گرایی آل پاچینو در فیلم مخمصه و ترکیب این دو هنر با یکدیگر، یک کلاس بازیگری محسوب می\u200Cشود و تا سال\u200Cها می\u200Cتوان از آن الگو برداری کرد.\n" +
            "داستان فیلم در مورد سرقتی بزرگ است که توسط نیک مک کالی (رابرت دنیرو) و همکاران سارقش به انجام می\u200Cرسد. در این دزدی یک مأمور پلیس کشته می\u200Cشود و همین موجب می\u200Cشود که پای کارآگاه بزرگ «وینسنت هانا» (آل پاچینو) به ماجرا باز شود.\n" +
            "تحقیقات هانا شروع می\u200Cشود و در طرف دیگر قضیه، نیک متوجه حضور این کارآگاه شده و سعی دارد اورا سر بدواند.\n" +
            "این بخش ابتدایی فیلم است و با شروع بخش\u200Cهای دیگر داستان جذاب مخمصه آغاز می\u200Cشود.\n" +
            "اگر تاکنون نتوانسته\u200Cاید این فیلم را ببینید، پیشنهاد می\u200Cکنم در اولین فرصت آن را تماشا کنید و مطمئن باشید که از تماشای آن پشیمان نمی\u200Cشوید. چنین فیلم\u200Cهایی شناسنامه هالیوود هستند و دیدن آن\u200Cها برای دوست داران سینما الزامی است.\n‌"
    const val arrivalName = "ورود - Arrival"
    const val arrivalNameDirector = "دنی ویلنوو"
    const val arrivalYearOfConstruction = "2016"
    const val arrivalNameAuthor = "اریک هیزرر"
    const val arrivalFullDescription = "از دیگر فیلم های درام برتر می\u200Cتوان فیلم ورود (Arrival) را نام برد. این عنوان یکی از بهترین فیلم های 2016 از دیدگاه کاربران iMDB بود و توسط دنی دیلنوو ساخته شد. نویسندگی این اثر توسط اریک هیزرر به انجام رسید و اقتباسی از داستانی کوتاه به نام «داستان زندگی تو» است که به قلم تد چیانگ به تحریر درآمده است.\n" +
            "از بازیگران این فیلم می\u200Cتوان ایمی آدامز، جرمی رنر، مایکل استولبارگ و فارست ویتاکر را نام برد.\n" +
            "داستان فیلم درباره زنی جوان به نام لوئیس است. لوئیس استاد زبان شناسی است و اکثر اوغات خود را در دانشگاه و تدریس سپری می\u200Cکند. او که به تازگی با فقدانی بزرگ مواجه شده، وارد چالشی جدی و سرنوشت ساز می\u200Cشود. پس از ورود 12 سفینه فضایی به زمین و مستقر شدن آن\u200Cها در جای جای مختلف زمین، تیمی تحقیقاتی در ایالات متحده تشکیل می\u200Cشود تا به مأموریتی برای شناسایی و تشخیص تهدید آمیز بودن یا نبودن سفینه\u200Cای که در قاره آمریکا فرود آمده فرستاده شوند.\n" +
            "لوئیس در این مأموریت وظیفه دارد که با این سفینه و موجودات ارتباط برقرار کند و ...\n" +
            "این فیلم یکی از بهترین درام-علمی تخیلی\u200Cهای تاریخ سینما است. (از دیدگاه نویسنده مقاله)\n" +
            "فیلم ورود یا (نو رسیده) در 8 بخش از جوایز جشنواره اُسکار 2016 نامزد کسب جایزه شد که نهایتا جایزه بهترین تدوین صدا را کسب کرد.\n"
    const val theDropName = "The Drop - کندو"
    const val theDropNameDirector = "میکِل آر. روسکَم"
    const val theDropYearOfConstruction = "2014"
    const val theDropNameAuthor = "دنیس لهان"
    const val theDropFullDescription = "کندو یکی دیگر از فیلم های درام-جنایی خوش ساخت است که در سال 2014 توسط میکل آر. روسکم ساخته شد و بازیگرانی همچون تام هاردی و نومی راپاس در آن ایفای نقش کرده\u200Cاند.\n" +
            "داستان فیلم در مورد گانگسترهای چچنی است که پول\u200Cهای قمار خود را هر هفته در یک بار جمع آوری می\u200Cکنند و آن را به اصطلاح کندو می\u200Cنامند. این کندوها حکم گاوصندوق\u200Cهای امنی را دارند که برای پولشویی و فرار مالیاتی ایجاد شده\u200Cاند.\n" +
            "یکی از شب\u200Cها، کندوی روس\u200Cها باره مارف می\u200Cشود. مارف بار را به همراه برادرزاده\u200Cی درون\u200Cگرای خود باب ساگینوفسکی (تام هاردی) اداره می\u200Cکند و در همان شب شرط بندی مورد سرقت قرار می\u200Cگیرد. خلافکارهای چچنی به مارف می\u200Cگویند که مسئول گم شدن 5000 دلار خود اوست و باید یا سارق را پیدا کند و پول\u200Cها را برگرداند، یا از جیب خود 5 هزار دلار به حساب تزریق کند. به همین دلیل باب تصمیم می\u200Cگیرد به عموی خود کمک کند اما ...\n" +
            "The Drop یکی از شکست\u200Cهای بزرگ سینما از لحاظ تجاری محسوب می\u200Cشود. به طوری که تنها 6 میلیون دلار سودآوری برای سازندگان خود به ارمغان آورد. اما از لحاظ تکنیکال و خط داستانی فیلمی خوب و قابل قبول محسوب می\u200Cشود.\n" +
            "اگر به دنبال تماشای فیلم درام باشید، دراپ یکی از گزینه\u200Cهای خوب و سرگرم کننده برای شماست. امیدوارم از تماشای این اثر لذت ببرید.\n"
    const val onceUponATimeInHollywoodName = "روزی روزگاری در هالیوود"
    const val onceUponATimeInHollywoodNameDirector = "کوئنتین تارانتینو"
    const val onceUponATimeInHollywoodYearOfConstruction = "2019"
    const val onceUponATimeInHollywoodNameAuthor = "کوئنتین تارانتینو"
    const val onceUponATimeInHollywoodFullDescription = "روزی روزگاری در هالیوود (Once Upon a Time in Hollywood) اثر کارگردان بزرگ کوئنتین تارانتینو یکی دیگر از بهترین فیلم های درام در تاریخ سینما است که مورد توجه سینمادوستان قرار گرفت. این فیلم بعد از اکران خیلی سریع با تحسین گسترده منتقدان مواجه شد و توانست نظر مثبت بسیاری از طرفداران را جلب کند.\n" +
            "فیلم روزی روزگاری در هالیوود در مراسم اسکار 2019 نامزد دریافت جایزه در ده بخش بود و درنهایت توانست در دو بخش بهترین بازیگر نقش مکمل مرد برای برد پیت و بهترین طراحی صحنه این جوایز را به\u200Cدست بیاورد. این فیلم که بودجه 96 میلیون دلاری تولید شده بود، توانست بیش از 389 میلیون دلار در باکس\u200Cآفیس فروش داشته باشد.\n" +
            "بازیگران بزرگ زیادی در فیلم روزی روزگاری در هالیوود به ایفای نقش پرداختند؛ ازجمله مهم\u200Cترین بازیگران این فیلم می\u200Cتوان به لئوناردو دی\u200Cکاپریو، برد پیت، مارگو رابی، کرت راسل، تیموتی اولفینت، داکوتا فانینگ، لوک پری، مارگارت کوالی و آل پاچینو اشاره کرد.\n" +
            "خلاصه داستان فیلم روزی روزگاری در هالیوود بدین شرح است: ریک دالتون بازیگری است که حرفه خود را با حضور در آثار تلویزیونی آغاز کرده و عمده شهرت خود را مدیون یک سریال وسترن است که از اواخر دهه 50 تا اوایل دهه 60 پخش می\u200Cشده \u200Cاست. " +
            "مدتی است که ستاره بخت ریک افول کرده و وی اوضاع مناسبی ندارد و به الکل پناه برده \u200Cاست. در این شرایط سخت فقط دوست صمیمی وی، یعنی کلیف است که او را همراهی می\u200Cکند. کلیف که بدلکار همیشگی ریک در آثارش بوده، یک ارتشی سابق است که شایعه\u200Cها می\u200Cگوید همسر خود را به قتل رسانده اما وی از زندگی خود راضی است؛ در مقابل ریک معتقد است دوران او دیگر تمام شده و شاید بهتر باشد دنبال کار دیگری باشد." +
            " با گذشت مدتی کلیف و ریک هرکدام سر پروژه\u200Cای می\u200Cروند. کلیف به عنوان بدلکار وارد سریال زنبور سبز شده و ریک نیز نقش منفی سریال لنسر را ایفا می\u200Cکند.\n"
    const val roomName = "اتاق – Room"
    const val roomNameDirector = "لنی آبراهامسون"
    const val roomYearOfConstruction = "2015"
    const val roomNameAuthor = "اما داناهیو"
    const val roomFullDescription = "اتاق (Room) فیلمی مستقل به کارگردانی لنی آبراهامسون است که در سال 2015 اکران شد و توانست با تحسین گسترده منتقدین مواجه شود. این اثر که جزو بهترین فیلم های درام تاریخ سینما است، برپایه رمانی به همین نام اثر اما داناهیو ساخته شد؛ خود داناهیو فیلم\u200Cنامه این فیلم را به\u200C رشته تحریر درآورد. بسیاری از منتقدان علاوه\u200Cبر قدرت فیلم\u200Cنامه، به\u200Cدلیل بازی فوق\u200Cالعاده بازیگران (به\u200Cخصوص بری لارسون) این فیلم را مورد تحسین قرار دادند.\n" +
            "فیلم اتاق طی مراسم اسکار سال 2016 در چهار بخش نامزد دریافت جایزه اسکار شده بود که درنهایت تنها توانست جایزه بهترین بازیگر نقش اول زن برای بازی بری لارسون را کسب کند. علاوه\u200Cبر لارسون، مهم\u200Cترین بازیگرانی که در این فیلم به ایفای نقش پرداختند عبارت\u200Cاند از: جیکوب ترمبلی، جوآن آلن و ویلیام اچ میسی. این فیلم با بودجه 13 میلیون دلاری تولید شد، بیش از 36 میلیون دلار در باکس\u200Cآفیس فروش کرد.\n" +
            "خلاصه داستان فیلم اتاق بدین شرح است: این فیلم روایتگر زندگی زن جوانی به نام جوی است که هفت سال قبل در سن 17 سالگی توسط مردی که ادعا کرده بود سگ مریضش نیاز به کمک دارد ربوده شده و در یک آلونک حدودا 10 متری زندانی شده \u200Cاست و" +
            " هیچ ارتباطی با دنیای خارج ندارد. وی در سال دوم حصر، از آن مرد، که از وی به عنوان نیک پیر یاد می\u200Cکنند، صاحب یک پسر به اسم جک نیز شده \u200Cاست. در ابتدای فیلم، مادر و فرزند تولد 5 سالگی جک را جشن می\u200Cگیرند. در ادامه فیلم از زبان جوی می\u200Cشنویم که وی بارها قصد فرار داشته اما موفق به این کار نشده \u200Cاست. اما درنهایت مادر و فرزند موفق به فرار می\u200Cشوند و نیک فراری شده اما اندکی بعد دستگیر می\u200Cشود.\n"
    const val whiplashName = "ویپلش – Whiplash"
    const val whiplashDirector = "دیمین شزل"
    const val whiplashYearOfConstruction = "2014"
    const val whiplashNameAuthor = "دیمین شزل"
    const val whiplashFullDescription = "ویپلش (Whiplash) فیلمی درام به کارگردانی دیمین شزل است که بعد از اکران در سال 2014، به موفقیت\u200Cهای زیادی دست پیدا کرد.\n" +
            "فیلم ویپلش توجه منتقدان زیادی را به سمت خود جلب کرد و موفق شد نمرات بسیار خوبی را از جانب آن\u200Cها دریافت کند. منتقدان این اثر را بیشتر به دلیل داستان جذاب و بازی عالی گروه بازیگری\u200Cاش مورد تحسین قرار دادند. این فیلم اکنون جزو 250 فیلم برتر سایت IMDB است. جالب است بدانید که فیلم\u200Cبرداری فیلم ویپلش تنها 19 روز به طول انجامید.\n" +
            "فیلم ویپلش نه تنها در جلب نظر منتقدین، بلکه در دریافت نقدهای مثبت از سوی مخاطبین نیز موفق ظاهر شد و توانست به فروش نسبتا خوبی در باکس\u200Cآفیس دست پیدا کند.\n" +
            "این فیلم طی مراسم اسکار سال 2015 در پنج بخش نامزد دریافت جایزه اسکار شده بود که درنهایت توانست در بخش\u200Cهای بهترین بازیگر نقش مکمل مرد برای بازی جی. کی. سیمنز، بهترین صدابرداری و بهترین تدوین این جایزه را به\u200Cدست بیاورد.\n" +
            "فیلم ویپلش تنها با بودجه 3.3 میلیون دلاری تولید شد و توانست چیزی در حدود 49 میلیون دلار در باکس\u200Cآفیس بفروشد. ازجمله مهم\u200Cترین بازیگرانی که در این فیلم به ایفای نقش پرداختند می\u200Cتوان به مایلز تلر، جی. کی. سیمونز، جیسون بلر، ملیسا بنویست و آستین استول اشاره کرد.\n" +
            "خلاصه داستان فیلم ویپلش بدین شرح است: اندرو نیمن نوازنده درام یک گروه موسیقی است که به امید پذیرفته شدن توسط یکی از بهترین استادهای موسیقی به نام ترنس فلچر به هنرستان شیفر که به عقیده خودش بهترین هنرستان موسیقی در آمریکا است، می\u200Cرود تا بتواند به هدف خودش که تبدیل شدن به بهترین نوازنده درام گروه موسیقی شیفر است، برسد. بعد از یک ملاقات سرد و نه چندان خوب، در کمال تعجب فلچر او را می\u200Cپذیرد و این سرآغاز ماجرای این دو است که سراسر با شکنجه، تحقیر، سختی و حس ناامیدی پیوند خورده\u200C است.\n" +
            "\n"
    fun String.toNumberFA(): String {
        var num = this
        val faNumbers = arrayOf(
            arrayOf("0", "۰"),
            arrayOf("1", "۱"),
            arrayOf("2", "۲"),
            arrayOf("3", "۳"),
            arrayOf("4", "۴"),
            arrayOf("5", "۵"),
            arrayOf("6", "۶"),
            arrayOf("7", "۷"),
            arrayOf("8", "۸"),
            arrayOf("9", "۹")
        )
        for (i in faNumbers) {
            num = num.replace(i[0], i[1])
        }
        return num
    }
}